const podcasts = [
    {
        id: 1,
        title: "Patch V1.0 - exe",
        author: "update.exe",
        cover: "https://biaupload.com/do.php?imgf=org-e356c1ef73f81.jpg",
        audio: "https://biaupload.com/do.php?filename=org-9c7a94f7c5241.mp3",
        publishDate: "منتشر شده در28 اردیبهشت 1404",
        description: "پنج خبر برتر این هفته رو بررسی و نگاه اجمالی انداختیم",
        likes: 34,
        listeners: 34,
        currentListeners: 34,
        isLiked: false,
        comments: [
            { id: 1, name: "mmd", text: "تحلیل  جامع و دقیقی بود!" },
            { id: 2, name: "رضا", text: "ممنون از اطلاعات ویلی کوتاه بود زمان بیشتر و توضیح بیشتر بهتر میشه" },
            { id: 3, name: "ناشناس", text: "ادیت ضعیفه اما محتوا عالیه" },
            { id: 4, name: "asal", text: "من تازه با هوش مصنوعی آشنا شدم، واقعا کمکم کرد" },
            { id: 5, name: "محسن", text: "صدای خیلی خوبی داری" },
            { id: 6, name: "aa", text: "لطفا بیشتر راجع به اخلاق در هوش مصنوعی صحبت کنید" },
            { id: 7, name: "فاطمه", text: "چطوری عضو شم؟" },
            { id: 8, name: "mahdi", text: "دونفره ظبط کن جالب تر میشه" },
            { id: 9, name: "حدیث", text: "لطفا کیفیت صدا رو بهتر کنید" },
            { id: 10, name: "حسین", text: "دمتون گرم، عالی بود" } , 
        ]
    },
    // {
    //     id: 2,
    //     title: "مقایسه پردازنده‌های نسل جدید",
    //     author: "تیم تک‌پاد",
    //     cover: "https://wallpapercg.com/media/ts_orig/22148.webp",
    //     audio: "https://irsv.upmusics.com/dlw/Makan%20Ghashghaei%20-%20Mahi%20(320).mp3",
    //     publishDate: "منتشر شده در ۵ دی ۱۴۰۲",
    //     description: "در این اپیزود به مقایسه پردازنده‌های نسل جدید اینتل و AMD می‌پردازیم. از معماری تا کارایی در برنامه‌های مختلف را بررسی می‌کنیم.",
    //     likes: 315,
    //     listeners: 1870,
    //     currentListeners: 245,
    //     isLiked: false,
    //     comments: [
    //         { id: 1, name: "lord_mmd", text: "جالب!" },
    //         { id: 2, name: "نازنین", text: "من تازه می‌خوام سیستم بخرم، خیلی کمکم کرد" },
    //         { id: 3, name: "امیرحسین", text: "لطفا بیشتر راجع به پردازنده‌های موبایل توضیح بدید" },
    //         { id: 4, name: "سپهر", text: "کی راجع به کارت‌های گرافیک صحبت می‌کنید؟" },
    //         { id: 5, name: "ترانه", text: "صداتون عالیه" },
    //         { id: 6, name: "کامیار", text: "بخش بنچمارک‌ها خیلی خوب بود" },
    //         { id: 7, name: "یاسمن", text: "من همه پادکست‌هاتون رو گوش میدم" },
    //         { id: 8, name: "فرهاد", text: "لطفا کیفیت صدا رو بهتر کنید" },
    //         { id: 9, name: "نرگس", text: "کی قسمت بعدی میاد؟" },
    //         { id: 10, name: "پارسا", text: "دمتون گرم، عالی بود" }
    //     ]
    // }
];

const archiveItems = [
    { id: 1, title: "پنج خبر جدید در آپدیت v1.0", date: "28 اردیبهشت 1404" },
    // { id: 2, title: "مقایسه پردازنده‌های نسل جدید", date: "۵ دی ۱۴۰۲" },
    // { id: 3, title: "معرفی فناوری‌های نمایشگر در CES 2024", date: "۲۸ آذر ۱۴۰۲" },
    // { id: 4, title: "راهنمای خرید لپ‌تاپ برای برنامه‌نویسان", date: "۲۰ آذر ۱۴۰۲" },
    // { id: 5, title: "بررسی امنیت سایبری در سال جدید", date: "۱۲ آذر ۱۴۰۲" },
    // { id: 6, title: "آموزش Docker برای توسعه‌دهندگان", date: "۵ آذر ۱۴۰۲" },
    // { id: 7, title: "مصاحبه با توسعه‌دهنده ارشد گوگل", date: "۲۸ آبان ۱۴۰۲" },
    // { id: 8, title: "بررسی سیستم‌عامل‌های جدید", date: "۲۰ آبان ۱۴۰۲" },
    // { id: 9, title: "آموزش React Native برای مبتدیان", date: "۱۲ آبان ۱۴۰۲" },
    // { id: 10, title: "معرفی بهترین ابزارهای توسعه 2023", date: "۵ آبان ۱۴۰۲" },
    // { id: 11, title: "بررسی مشکلات امنیتی ChatGPT", date: "۲۸ مهر ۱۴۰۲" },
    // { id: 12, title: "تکنیک‌های بهینه‌سازی کد", date: "۲۰ مهر ۱۴۰۲" }
];
